#define _CRT_SECURE_NO_WARNINGS 1
#include"Date.h"

void test()
{
	//// 日期+=天数
	//Date d1(2025, 8, 3);
	//Date d2=d1+=100;
	////d1.operator+=(100);
	//d1.Print();
	//d2.Print();

	//// 日期+天数
	//Date d3(2025, 8, 3);
	//Date d4= d3 + 100;
	////d3.operator+(100);
	//d3.Print();
	//d4.Print();
	//
///////////////////////////////////////

	//// 日期-=天数
	//Date d1(2025, 8, 3);
	//Date d2 = d1 -= 100;
	////d1.operator-=(100);
	//d1.Print();
	//d2.Print();

	//// 日期-天数
	//Date d3(2025, 8, 3);
	//Date d4 = d3 - 100;
	////d3.operator-=(100);
	//d3.Print();
	//d4.Print();

////////////////////////////////////////////

	//// 前置++
	//Date d1(2025, 8, 3);
	//Date ret1 = ++d1;
	//d1.Print();//2025,8,4
	//ret1.Print();//2025,8,4

	////后置++
	//Date d2(2025, 8, 3);
	//Date ret2 = d2++;
	//d1.Print();//2025,8,4
	//ret2.Print();//2025,8,3

/////////////////////////////////////////////

	////前置--
	//Date d1(2025, 8, 3);
	//Date ret1=--d1;
	//d1.Print();//2025,8,2
	//ret1.Print();//2025,8,2

	////后置--
	//Date d2(2025, 8, 3);
	//Date ret2=d2--;
	//d2.Print();//2025,8,2
	//ret2.Print();//2025,8,3

///////////////////////////////////////////////

	//Date d1(2025, 8, 3);
	//Date d2(2025, 8, 5);
	//Date d3(2025, 8, 3);

	////== 运算符重载
	//cout << (d1 == d3) << '\n';//1
	//cout << (d1 == d2) << '\n'<<'\n';//0
	//
	////>运算符重载
	//cout << (d1 > d3) << '\n';//0
	//cout << (d1 > d2) << '\n';//0
	//cout << (d2 > d1) << '\n'<<'\n';//1
	//
	//// >=运算符重载
	//cout << (d1 >= d3) << '\n';//1,=
	//cout << (d1 >= d2) << '\n';//0,<
	//cout << (d2 >= d1) << '\n'<<'\n';//1,>
	//
	////<运算符重载
	//cout << (d1 < d3) << '\n';//0
	//cout << (d1 < d2) << '\n';//1
	//cout << (d2 < d1) << '\n'<<'\n';//0

	//// <=运算符重载
	//cout << (d1 <= d3) << '\n';//1,=
	//cout << (d1 <= d2) << '\n';//1,<
	//cout << (d2 <= d1) << '\n'<<'\n';//0,>

	////!= 运算符重载
	//cout << (d1 != d3) << '\n';//0
	//cout << (d1 != d2) << '\n'<<'\n';//1

/////////////////////////////////////////////////

	// 日期-日期 返回天数
	Date d1(2025, 10, 1);
	Date d2(2025, 9, 17);
	int days1 = d1 - d2;//-2
	int days2 = d2 - d1;//2
	cout << days1 << '\n' << days2 << '\n';
}

void test1()
{
	Date d1(2024, 4, 14);
	Date d2 = d1 + 30000;
	// operator<<(cout, d1)
	cout << d1;
	cout << d2;
	cin >> d1 >> d2;
	cout << d1 << d2;
}
int main()
{
	test();
	//test1();
	return 0;
}